MMMZZZZ/Random-Stuff/TI/TivaWare_C_Series-2.2.0.295/examples/boards/ek-tm4c1294xl-boostxl-senshub/compdcm_mpu9150/compdcm_mpu9150.c
    ui32CompDCMStarted = 0;

    while(1)
    {
        //
        // Go to sleep mode while waiting for data ready.
        //
        while(!g_vui8I2CDoneFlag)
        {
            MAP_SysCtlSleep();
        }

        //
        // Clear the flag
        //
        g_vui8I2CDoneFlag = 0;

        //
        // Get floating point version of the Accel Data in m/s^2.
        //
        MPU9150DataAccelGetFloat(&g_sMPU9150Inst, pfAccel, pfAccel + 1,
                                 pfAccel + 2);

        //
        // Get floating point version of angular velocities in rad/sec
        //
        MPU9150DataGyroGetFloat(&g_sMPU9150Inst, pfGyro, pfGyro + 1,
                                pfGyro + 2);

        //
        // Get floating point version of magnetic fields strength in tesla
        //
        MPU9150DataMagnetoGetFloat(&g_sMPU9150Inst, pfMag, pfMag + 1,
                                   pfMag + 2);

        //
        // Check if this is our first data ever.
        //
        if(ui32CompDCMStarted == 0)
        {
            //
            // Set flag indicating that DCM is started.
            // Perform the seeding of the DCM with the first data set.
            //
            ui32CompDCMStarted = 1;
            CompDCMMagnetoUpdate(&g_sCompDCMInst, pfMag[0], pfMag[1],
                                 pfMag[2]);
            CompDCMAccelUpdate(&g_sCompDCMInst, pfAccel[0], pfAccel[1],
                               pfAccel[2]);
            CompDCMGyroUpdate(&g_sCompDCMInst, pfGyro[0], pfGyro[1],
                              pfGyro[2]);
            CompDCMStart(&g_sCompDCMInst);
        }
        else
        {
            //
            // DCM Is already started.  Perform the incremental update.
            //
            CompDCMMagnetoUpdate(&g_sCompDCMInst, pfMag[0], pfMag[1],
                                 pfMag[2]);
            CompDCMAccelUpdate(&g_sCompDCMInst, pfAccel[0], pfAccel[1],
                               pfAccel[2]);
            CompDCMGyroUpdate(&g_sCompDCMInst, -pfGyro[0], -pfGyro[1],
                              -pfGyro[2]);
            CompDCMUpdate(&g_sCompDCMInst);
        }

        //
        // Increment the skip counter.  Skip counter is used so we do not
        // overflow the UART with data.
        //
        g_ui32PrintSkipCounter++;
        if(g_ui32PrintSkipCounter >= PRINT_SKIP_COUNT)
        {
            //
            // Reset skip counter.
            //
            g_ui32PrintSkipCounter = 0;

            //
            // Get Euler data. (Roll Pitch Yaw)
            //
            CompDCMComputeEulers(&g_sCompDCMInst, pfEulers, pfEulers + 1,
                                 pfEulers + 2);

            //
            // Get Quaternions.
            //
            CompDCMComputeQuaternion(&g_sCompDCMInst, pfQuaternion);

            //
            // Convert mag data to micro-tesla for better human interpretation.
            //
            pfMag[0] *= 1e6;
            pfMag[1] *= 1e6;
            pfMag[2] *= 1e6;

            //
            // Convert Eulers to degrees. 180/PI = 57.29...
            // Convert Yaw to 0 to 360 to approximate compass headings.
            //
            pfEulers[0] *= 57.295779513082320876798154814105f;
            pfEulers[1] *= 57.295779513082320876798154814105f;
            pfEulers[2] *= 57.295779513082320876798154814105f;
            if(pfEulers[2] < 0)
            {
                pfEulers[2] += 360.0f;
            }

            //
            // Now drop back to using the data as a single array for the
            // purpose of decomposing the float into a integer part and a
            // fraction (decimal) part.
            //
            for(ui32Idx = 0; ui32Idx < 16; ui32Idx++)
            {
                if (pfData[ui32Idx] < 0)
                {
                    cSign[ui32Idx] = '-';
                }
                else
                {
                    cSign[ui32Idx] = ' ';
                }

                //
                // Convert float value to a integer truncating the decimal part.
                //
                i32IPart[ui32Idx] = (int32_t) fabs(pfData[ui32Idx]);

                //
                // Multiply by 1000 to preserve first three decimal values.
                // Truncates at the 3rd decimal place.
                //
                i32FPart[ui32Idx] = (int32_t) fabs((pfData[ui32Idx] * 1000.0f));

                //
                // Subtract off the integer part from this newly formed decimal
                // part.
                //
                i32FPart[ui32Idx] = i32FPart[ui32Idx] -
                                    (i32IPart[ui32Idx] * 1000);
                                    
                //
                // Handle the corner case where a negative number that is less
                // than 0.000 was displaying as '-0.000' on the terminal.
                //
                if ((i32FPart[ui32Idx] == 0) && (i32IPart[ui32Idx] == 0))
                {
                    cSign[ui32Idx] = ' ';
                }
            }

            //
            // Print the acceleration numbers in the table.
            //
            UARTprintf("\033[5;17H%c%1d.%03d", cSign[0],i32IPart[0], i32FPart[0]);
            UARTprintf("\033[5;40H%c%1d.%03d", cSign[1],i32IPart[1], i32FPart[1]);
            UARTprintf("\033[5;63H%c%1d.%03d", cSign[2],i32IPart[2], i32FPart[2]);

            //
            // Print the angular velocities in the table.
            //
            UARTprintf("\033[7;17H%c%1d.%03d", cSign[3],i32IPart[3], i32FPart[3]);
            UARTprintf("\033[7;40H%c%1d.%03d", cSign[4],i32IPart[4], i32FPart[4]);
            UARTprintf("\033[7;63H%c%1d.%03d", cSign[5],i32IPart[5], i32FPart[5]);

            //
            // Print the magnetic data in the table.
            //
            UARTprintf("\033[9;17H%c%1d.%03d", cSign[6],i32IPart[6], i32FPart[6]);
            UARTprintf("\033[9;40H%c%1d.%03d", cSign[7],i32IPart[7], i32FPart[7]);
            UARTprintf("\033[9;63H%c%1d.%03d", cSign[8],i32IPart[8], i32FPart[8]);

            //
            // Print the Eulers in a table.
            //
            UARTprintf("\033[14;17H%c%1d.%03d", cSign[9],i32IPart[9], i32FPart[9]);
            UARTprintf("\033[14;40H%c%1d.%03d", cSign[10],i32IPart[10], i32FPart[10]);
            UARTprintf("\033[14;63H%c%1d.%03d", cSign[11],i32IPart[11], i32FPart[11]);

            //
            // Print the quaternions in a table format.
            //
            UARTprintf("\033[19;14H%c%1d.%03d", cSign[12],i32IPart[12], i32FPart[12]);
            UARTprintf("\033[19;32H%c%1d.%03d", cSign[13],i32IPart[13], i32FPart[13]);
            UARTprintf("\033[19;50H%c%1d.%03d", cSign[14],i32IPart[14], i32FPart[14]);
            UARTprintf("\033[19;68H%c%1d.%03d", cSign[15],i32IPart[15], i32FPart[15]);

        }
    }
}
